#include <iostream>


/*
Реалізувати абстрактний базовий клас з вказаними чисто віртуальними
(абстрактними) функціями і чисто віртуальними функціями вводу/виводу.
Утворити похідні класи базового класу, в яких здійснити реалізацію всіх
чисто віртуальних функцій. Самостійно визначити, які поля необхідні і які з
них визначити в базовому класі, а які – в похідних
 *
8. Створити абстрактний базовий клас Function (функція) з віртуальними
методами обчислення значення функції в заданій точці x і виводу результату
на екран. Визначити похідні класи Ellipse (еліпс) і Hyperbola (гіпербола) з
власними функціями обчислення значення і друку.
Створити клас Series (набір), що містить масив/параметризовану
коллекцію об’єктів цих класів в динамічній пам’яті. Передбачити можливість
виводу всіх об’єктів списку. Додаткове завдання: доповини клас методами
сортування за деяким критерієм, виводу у файл та зчитування з файлу.
*/

#include <function.h>
#include <ellipse.h>
#include <hyperbola.h>
#include <series.h>

int main(int argc, char *argv[])
{
    Function A;
    Ellipse B(2, 3);
    Hyperbola C(12, 10);

    Series S(6);
    S.set(&A, 0);
    S.set(&B, 1);
    S.set(&C, 2);

    S.sortByValueIn(1, 0, 2);
    S.out("ples.txt", 0, 3);
    return 0;
}
